#include <stdio.h>

int main() {
//  Открытие файла
//  FILE * fopen("Путь", "["r", "w", "a", "r+", "w+", "a+"])

//  Закрытие файла
//  FILE * fclose()

//    FILE * fin;
//    char name[] = "1.txt";
//    if ((fin = fopen(name, "r"))==NULL)
//        printf("Not file");
//
//


//  Получить содержимое файла
//  fgetc(fin)
//  Зпись
//  fputc("символ", поток)

//  Прочитать из файла ввод
//  fscanf(поток, "Формат ввода")
//  Вывести в вайл вывод
//  fprintf(поток, "Формат ввода")

//  fgets(указатель на строку, кол-во символов, поток
//  fputs(указател на строку, поток)


//    FILE *f1, *f2;
//    int x, y;
//    printf("Enter a, b: ");
//    scanf("%d", &y);
//    f1 = fopen("1.txt", "w");
//    printf(f1, "%d", x);
//    fclose(f1);
//
//    f1 = fopen("1.txt", "r");
//    f2 = fopen("2.txt", "w");
//
//    fscanf(f1, "%d", &y);
//    y += 3;
//    fclose(f1);
//    fprintf((f2), "%d\n", y);
//    fclose(f2);
//

// МАССИВЫ
//    int a[5] = {1, 2, 3,4, 5};
//    int a[5] = {1, 2, 3,};
//    int a[5] = {0};
//    int a[5];
//    int a[] = {1, 2, 3, 4, 5};
    printf("%d, %d, %d, %d, %d", a[0], a[1], a[2], a[3], a[4]);


    return 0;


}
